[
  {
    "path": "posts/2021-06-08-dataviz-makeover2/",
    "title": "DataViz Makeover 2",
    "description": "DataViz Makeover 2 for ISSS608: Visual Analytics",
    "author": [
      {
        "name": "Stella Loh",
        "url": "https://www.linkedin.com/in/stella-loh-308b72129/"
      }
    ],
    "date": "2021-06-20",
    "categories": [
      "dataviz_makeover",
      "animation",
      "bubble chart",
      "trellis",
      "line graph",
      "bar chart"
    ],
    "contents": "\r\n\r\nContents\r\n1. Original Visualization\r\n2. Critiques\r\n3. Proposed Design\r\n4. Final Visualisation\r\n5. Data Visualisation Steps\r\n6. Observations\r\n\r\n\r\n\r\nbody{\r\n  background-color: #EBEDEF;\r\n  font-family:helvetica;\r\n}\r\n1. Original Visualization\r\nFigure 1: Original visualizationData Source\r\nThe data visualization above is created using data provided by Department of Statistics, Singapore (DOS).\r\n2. Critiques\r\n2.1 Clarity\r\nChart title refers to 2020 trade figures but commentary under the “I” note mentioned of years 2006 and 2009. Hence the user is unable to align what is in the commentary to title of the chart.\r\nIn this case, chart does not show trending of exports, imports and net exports/ imports, as well as historical information to show when Singapore’s trade with China and US has become net exporter and net importer respectively. Hence we are unable to align what we have read in the “I” section with what is shown in the graph.\r\nPoor placement of commentary- The “I” section acts as a commentary to provide users on the context of the chart and what it is trying to show and hence placement should be below the title and before the main visualization so that the user will read this section first before looking at the chart. In this case, the user will only see this commentary after seeing the main visualization.\r\nThe size of the bubble is not proportional to the total merchandise trade balances they represent. The “Lie Factor” is a value to describe the relation between the size of effect shown in a graphic and the size of effect shown in the data. Edward Tufte, Prof. at the Yale University, defined the “Lie Factor” in his book “The Visual Display of Quantitative Information” in 1983. This results in the below formula: \\[\\ Lie Factor = \\frac{size of effect shown in graphic}{size of effect in data}\\]  To ensure the integrity of a graphic, its Lie Factor should have a value between 0.95 and 1.05. If the value is less or greater, it indicates a substantial (and often intended) distortion, far beyond minor inaccuracies (e.g. caused by plotting).  In this case, comparing the size of the bubble for Mainland China and United States, we have arrived at the following computations. Total merchandise trade for Mainland China and United States in 2020 is S$136.2 billion and S$102.4 billion respectively. Hence total merchandise trade for Mainland China is about 33.01% higher than United States:\\[\\ Size of effect in data = \\frac{136.2 - 102.4}{102.4} * 100 = 33.01\\%\\]  Comparing the dimensions of the bubble representing the regions, United State’s bubble has a diameter of 4.6cm while Mainland China has a diameter of 6.2cm. Hence using the formula for calculation of circle area, area of China’s bubble is 81.66% bigger than United States:\\[\\ Size of effect shown in graphic = \\frac{3.1^2 - 2.3^2}{2.3^2} * 100 = 81.66\\%\\]  Hence, the lie factor is:\\[\\ Lie Factor = \\frac{81.66}{33.01} = 2.47\\]  The graphic has overstated differences by 247%. Users may thus get misled by the proportion of the bubble sizes represented in the chart, violating graphical integrity.  We have observed that the author seems to have presented the numbers proportional to diameter instead of area of the circle.\\[\\ Radius of United States bubble (diameter proportional) = {3.1*(\\frac{102.4}{136.2})}= 2.33\\]  This is incorrect and results in quadrupling of the circle area. To achieve accurate representation, the radius of United States bubble should be:\\[\\ Radius = \\sqrt{\\frac{102.4}{136.2}} * 3.1 = 2.69\\]\r\nThe data source has a note included which lists the countries which are included under the EU category. This was not included as a note in the chart for the user’s clarity.\r\nLabeling of the axis is not clear. “Export” label is written underneath the y-axis (which represents imports) and “Import” label is written to the left of the x-axis (which represents exports).\r\nChart did not specify what the labels are referring to- if they are referring to exports/ imports or total merchandise trade.\r\nChart uses a note (instead of a legend) at the bottom to indicate that size of the bubbles is indicative of total merchandise trade value with the trading partner. This makes it less intuitive as the user is not able to decipher that at first glance and hence has to read on to understand what the size of the bubble represents.\r\nPerceptions of area versus magnitude can vary per person. The perceived area of a circle grows more slowly than the actual. Hence using two dimensional objects (area of circle) to represent scalars (total merchandise trade in this case) is naturally misleading.\r\n2.2 Aesthetics\r\nAxis does not contain information on what currency this is measured in and must be read off the labels. This can be included in the axis information.\r\nChart uses labels instead of legends to show which color is representative of each region. However, due to the size of each different colored circle and the addition of labels, the chart looks cluttered.\r\nThe labels overlap other marks. For example, the label for United States is blocking the user from seeing the center point of the Taiwan bubble and the Europe label also overlaps with the Malaysia bubble.\r\nSize of the bubbles are too big and opacity is not adjusted for overlaps and hence creates overlap, obscuring information and clutters the chart. Most of the bubbles overlap but the opacity of the bubbles is not adjusted. This makes it difficult to read the chart. For example, for Republic of Korea, we are unable to see the center point of the circle which is supposed to show if the region is a net exporter or importer, especially since the bubble falls close to the cutoff line between net exporter and importer. Same issue for EU and Malaysia. The size of the bubbles can also be reduced and made less opaque to reduce chart clutter.\r\nThere is poor use of colors in the chart. Other than colors being used to differentiate region, background colors use another set of colors and is not particularly useful as it does not seem to serve any additional purpose. A reference line is sufficient to demarcate the cutoff between net exporters and importers.\r\nToo many symbols are used in this chart, and they look similar which may also confuse the user. For example, the top net exporter and importer are each given a symbol and annotated next to the region’s bubble in the chart. This adds on to the clutter of colors and shapes we already see in the chart. Furthermore, exports and imports are given yet another set of symbols which have similar colors to top net exporters and importers respectively. Only minor differences are noted between each set of symbols. There is no need to have symbols for exports and imports as they do not serve any purpose and the user is better off simply reading the axis labels.\r\nDue to the size of the bubbles and labels, the chart looks cluttered. Some of the labels (Mainland China and Hong Kong) fall outside the main chart pane.\r\nInteractivity of the chart is added to provide additional clarity due to the overlapping bubbles and do not provide any additional information.\r\n3. Proposed Design\r\nSketch\r\nFigure 2: Sketch of proposed designAdvantages of proposed design\r\n3.1 Clarity\r\nTitle added at the top for reader to understand the main idea of the visualization.\r\nTitle of dashboard indicates periods that the figures are derived from. Also, interactivity is added so that user is able to toggle and adjust the date that they wish to see.\r\nCommentary is added right below title to provide users on the context of the chart. Commentary also refers to the same period as what is reflected in the charts (2011-2020), hence allowing users to align the commentary with the charts.\r\nIncluded note which states the countries which are included under the EU category. This is important as EU is not a country and instead consists of several countries under this categorization.\r\nAxis are clearly labeled without the need to use symbols. Top Net Exporter and Top Net Importer for each period is also indicated in the interactive tooltip functions, without the use of symbols as in the original visualization, hence reducing clutter.\r\nInstead of using labels which may cause clutter in the chart, we have used the interactive tooltip function to provide additional details on Import, Export, Net Trade and even Ranking of the regions.\r\nLegend is used to indicate that size of the bubble is indicative of total merchandise trade value with the trading partner. This makes it more intuitive as the user is able to decipher straightaway what the size of the bubble represents.\r\nThe area of the bubbles have been adjusted to be approximately proportional to the total merchandise trade balances they represent. We have also added additional details via tooltips where users can hover over the bubble to get the exact total merchandise trade balance instead of relying solely on the size of the bubbles.\r\n3.2 Aesthetics\r\nAxis contains all information on denomination of the figures- both SGD and that the figures are denominated in billions.\r\nSize of labels have been reduced and is presented in plain string form (instead of in a box like original visualization). This reduces space taken up. Labels are also presented in the same color as the bubbles for alignment. This resolves the issue in the original visualization where the labels block essential information. Labels are also contained within the main chart pane.\r\nSize of bubbles has been adjusted smaller and opacity is adjusted to 50% to accommodate overlaps. Users will still be able to decipher essential information should the bubbles overlap. Black border has also been added to the bubbles to highlight the borders. These adjustments makes it easier to read the chart and reduce chart clutter.\r\nProposed visualization has removed the background colors as they not particularly useful and does not serve any additional purpose. A reference line and annotations have been added to demarcate the cutoff between net exports and net imports.\r\nProposed visualization has removed the top net exporter and importer symbols used in the original visualization with interactive functions instead. User can hover over each country to see the net trade ranking for that period. This reduces the clutter of symbols we see in the original visualization.\r\n4. Final Visualisation\r\n4.1 Snapshot of dashboard\r\nFigure 3: Snapshot of dashboard- full visualisation available at Tableau Public5. Data Visualisation Steps\r\nTableau Prep\r\nAfter downloading the data, select data for the relevant regions from each dataset (import and export dataset) and paste into 2 new sheets (one for export and the other for import) using Microsoft Excel. Save the file.\r\nFigure 4: Select data for relevant regionsOpen Tableau Prep and connect the file to Tableau Prep. Drag the relevant sheets onto the main pane.\r\nFigure 5: Drag sheets into main paneClick on + to add the next step. Select the pivot option and drag the period columns into the pivot fields pane. Period columns refer to those columns represented by “2011 Jan” through “2020 Dec”. This step is to tell Tableau Prep which fields should be pivoted.\r\nFigure 6: Select columns to pivotClick on + to add the next step. Next, we will join both datasets using the join function, with the below join clauses (Figure 7). The flow should now look similar to Figure 8.\r\nFigure 7: Inner join both datasetsFigure 8: Current stepsNext, add a clean step. We will now make the following changes to the joined dataset.\r\nMerge the two columns named “Variables” and “Variables-1” into one column as they represent the same information. Drag “Variables-1” into “Variables”.\r\nMerge the two columns named “Pivot1 Names” and “Pivot1 Names-1” into one column as they represent the same information. Drag “Pivot1 Names-1” into “Pivot1 Names”.\r\nRename “Pivot1 Values-1” and “Pivot1 Values” into “Imports” and “Exports” respectively.\r\nTrim the “Variables” column to remove unnecessary spaces. Right click on the “Variables” column title > select clean > select Trim Spaces.\r\nSplit “Variables” column using “(“ as separator. Right click on the”Variables\" column title > select Split Values > select Custom Split. Enter “(“ into the”Use the separator\" selection and retain the original selection under Split off field selection (Figure 9). Click on the split button. After splitting, remove the original column (“Variables”) and rename the newly split column as “Region”.\r\nRename “Pivot1 Names-1” column into “Date”. The current dataset should look similar to Figure 10.\r\n\r\nFigure 9: Split column selectionFigure 10: Dataset setupClick on + to add the next step. Select the Clean option and make the following amendments to the dataset.\r\nUpdate the variable datatypes:\r\nExports and Imports- from String to Number decimal type\r\nDate- from String to Date type\r\n\r\nCreate two new calculated fields and name them “Imports Aligned” and “Export Aligned”. This is to align the denomination of Europe (presented in millions) with the other regions (in thousands). The formulas should be as shown in Figure 11 (Imports Aligned) and Figure 12 (Export Aligned) below.\r\nRemove the original “Exports” and “Imports” columns.\r\n\r\nFigure 11: Create Imports Aligned Calculated FieldFigure 12: Create Export Aligned Calculated FieldClick on + to add the next step. Select the Output option. We will save the results in Tableau Data Extract format (.hyper). Select this format under “Output Type” and update the Name and Location. Leave the other options as default selections. See Figure 13 for the selections made. Once finalized, click Run Flow.\r\nFigure 13: Output file selectionsSave the Tableau Flow File by selecting File> Save As> Input Name of file and location to save in. This is so that we can refer back to this Tableau Prep Flow File if we need to make any amendments.\r\nTableau Desktop\r\nLine graph\r\nOpen Tableau Data Extract file saved previously. This should open up Tableau Desktop directly. The connections and extract table should already have been added in the file. Tableau Prep outputs Hyper files, and can publish data sources to Tableau Server or Tableau Online, connected to from Tableau Desktop. The Data Source tab should look like Figure 14 below (Tableau Extract file name will differ depending on what you have named the file).\r\nFigure 14: Data Source tabCreate a new sheet. As we will be presenting the charts for ten regions in the form of a trellis, we have to create two calculated fields called “x-axis” and “y-axis”.\r\nCreate a new calculated field and name it “x-axis”, with the below formula (Figure 15).\r\nCreate another calculated field named “y-axis”, with the below formula (Figure 16).\r\n\r\nFigure 15: x-axis calculated field formulaFigure 16: y-axis calculated field formulaDrag [Date] to columns and change selection to month. Change data type to continuous.\r\nFigure 17: Drag Date to columnsDrag [Export Aligned] to rows, then drag [Imports Aligned] and drop it into the chart as seen in Figure 18 below. This creates a Measure Values shelf that appears in the data pane and contains all the measures of the data collected into one field.\r\nFigure 18: Drag Export Aligned and Imports Aligned to rowsDrag the calculated fields [x-axis] and [y-axis] to Columns and Rows respectively. Convert both fields into discrete fields.\r\nFigure 19: Convert fields to discreteDrag [Region] into the Marks card under detail.\r\nFigure 20: Drag Region into detailClick on the small arrow next to [x-axis] in Columns. Select Edit table calculation > select computation using Specific Dimensions- by [Region] then by [Month of Date], at the level of [Region]. Do the same for [y-axis] in Rows.\r\nFigure 21: Edit table calculation for x-axis and y-axis fieldsCreate another calculated field named [Net Exports/Imports], with the below formula.\r\nFigure 22: Net Exports/Imports calculated fieldDrag [Net Exports/Imports] into Rows and select dual axis by clicking on the small arrow next to the field name. We will then synchronize the axis by right clicking on the axis and select synchronize axis (Figure 23).\r\nFigure 23: Synchronize axisOn the Marks card for [Net Exports/Imports], click the Mark Type drop-down and select bar.\r\nFigure 24: Change Mark type to barDrag [Net Exports/Imports] to Color on the Sum(Net Exports/ Imports) Marks card. On the Marks card, click Color > Edit Colors.\r\nUpdate stepped color option to 2 steps as we want to show negative and positive values in different colors (Figure 25).\r\nClick on the drop down under palette and select the red-green diverging option (Figure 25). Click ok.\r\nAdjust the slider under opacity to 50% (Figure 26).\r\n\r\nFigure 25: Update colorsFigure 26: Update opacityHide the below axis headers and field labels by deselecting Show Header and selecting hide field labels respectively.\r\nFigure 27: Hide Column Field LabelsFigure 28: Hide headerFigure 29: Hide headerFigure 30: Hide headerNext, we want to add a label to indicate which region each panel is representing. Drag [Region] into the Sum(Net Exports/Imports) Marks card, under Label. Click on Label and select Most Recent option, so labels will appear at the end of the bar chart, to avoid cluttering the graph with labels.\r\nFigure 31: Add Region LabelDrag [Date] into the Pages pane and select Month format by clicking on the arrow next to Date.\r\nFigure 32: Drag Date to Pages pane and select Month formatUpdate the Measure Values Marks Card and change Mark Type to Circle instead of Automatic.\r\nFigure 33: Update Mark Type to CircleOn the animation window that appears on the right of the sheet (below Measure Names), tick on Show history option and click on the arrow next to Show history. Make the following selections:\r\nMarks to show history for: Change to All\r\nShow: Both\r\nUnder Format in Trails section: Click on dropdown and select the second thinnest line option (Figure 35)\r\n\r\nFigure 34: Make the above animation selectionsFigure 35: Adjust line thicknessNext, we will amend the y-axis. Right click on y-axis and select Edit Axis. We will edit the y-axis for the following:\r\nUnder the General pane, update range. Select radio button for fixed and amend start and end to -5 and 10 respectively.\r\nUpdate Title under Axis Titles to “SGD (Billions)”.\r\nUnder the Tick Marks pane, select radio button for fixed and amend Tick Interval to 5.\r\n\r\nFigure 36: Update range and title of y-axisFigure 37: Update tick interval of y-axisNext, we will amend the x-axis. Right click on x-axis and select Edit Axis. We will edit the x-axis for the following:\r\nUnder the General pane, update range. Select radio button for fixed and amend start and end to 1/7/2010 and 30/6/2021 respectively. This is to provide a small gap at the start and end of each trellis panel. Next, uncheck Show times.\r\nUpdate Title under Axis Titles to “Month”.\r\nUnder the Tick Marks pane, select radio button for fixed and amend Tick origin to begin at 1/1/2011, and Tick Interval to 2 years.\r\n\r\nFigure 38: Update range and title of x-axisFigure 39: Update tick interval of x-axisUpdate the Legend Title by clicking on the small drop down arrow on the legend pane and selecting Edit Title.\r\nFigure 40: Update legend title- Trade TypeFigure 41: Update legend title- Net Exports/ImportsFigure 42: Update legend title- MonthCreate two calculated fields [Net Export position] and [Net Import position], with the formulas shown in Figure 43 and Figure 44 respectively. Drag these two fields into the Sum(Net Exports/Imports) Marks card under Tooltip.\r\nFigure 43: Create Net Export position calculated fieldFigure 44: Create Net Import position calculated fieldCreate another new calculated field [Ranking- Net Exports/Imports] with the formula shown in Figure 45 below. Drag the field into the Sum(Net Exports/Imports) Marks card under Tooltip.\r\nFigure 45: Create Ranking position calculated fieldClick on Tooltip > Insert the <AGG(Net Export position)> and <AGG(Net Import position)> under Net Exports/Imports and color them green and red respectively (Figure 46). Create a new section called Net Trade Ranking and insert the <AGG(Ranking)> value. Align the other tooltip fields to Figure 46 below. Edit Tooltip in the Measure Values Marks card to align with Figure 47.\r\nFigure 46: Edit Tooltip for Sum(Net Exports/Imports) Marks cardFigure 47: Edit Tooltip for Measure Values Marks cardClick on arrow next to Ranking- Net Exports/Imports > Compute Using > Select Region.\r\nFigure 48: Edit Ranking computationAlign fonts used in graph to Tableau Light. Adjust size of labels and legends to font size 9. Right click on the main chart pane > select format. In the sheets tab, adjust all fonts to Tableau Light.\r\nSort trellis by [Exports Aligned]. Under Measure Values Marks card, select [Region] > Sort > Sort by Field > Descending order > Input Field Name as “Export Aligned” > Select Sum under Aggregation. This sorts the trellis panel by exports across the ten regions.\r\nFigure 49: Sort by Export AlignedRight click on the main chart pane > select format > click on the arrow next to Fields and select the Sum (Export Aligned). Under the Pane tab, under Default section, click on the dropdown next to Numbers and select Number (Custom), then update Decimal Places to 2. Do this for Sum (Imports Aligned), Sum (Net Exports/ Imports), AGG(Net Export position) and AGG(Net Import position) too. This is to align all tooltips to 2 decimal places.\r\nFigure 50: Format variables to 2 decimal placesNext, we will editing the alias of the color legend. Right click on Export Aligned in the Trade Type legend > select Edit Alias > Rename as Exports. Do the same for Imports Aligned and rename as Imports.\r\nFigure 51: Edit alias of Trade Type legendAdd Title: “Singapore’s Exports, Imports and Net Trade Position with Regions, 2011-2020”. Apply bolding, change font size to 12 and font to Tableau Light. Change font color to white. Right click on title pane > select Format Title > Under Title section, select blue next to Shading.\r\nFigure 52: Format TitleUnder Measure Values Marks card, click on Size and drag the slider all the way to the left.\r\nFigure 53: Update size of circleBar Chart\r\nCreate two new calculated fields named [Running Total: Total Merchandise Trade] and [Ranking], with the below formulas.\r\nFigure 54: Create calculated field- Running Total: Total Merchandise TradeFigure 55: Create calculated field- Ranking: Total Merchandise TradeDrag [Date] into the Pages pane. Select MMM YYYY format for [Date]. Next, drag [Running Total: Total Merchandise Trade] into the Columns and click on arrow next to [Running Total: Total Merchandise Trade] > Edit Table Calculation > select Compute Using Specific Dimensions > Tick on the box next to Month of Date.\r\nFigure 56: Edit Table Calculation for Running Total: Total Merchandise TradeDrop [Region] into Marks card under Detail.\r\n.\r\nNext, drag [Ranking] into Rows. Click on arrow next to [Ranking] and select discrete. Next, click on arrow next to [Ranking] > Edit Table Calculation > select Compute Using Specific Dimensions > Tick on the box next to Region.\r\nFigure 58: Edit Table Calculation for RankingDrag [Region] into Marks card and drop it under Label and Color. Click on color and adjust opacity to 50%.\r\nFigure 59: Drag Region to Marks card under Label and ColorFigure 60: Adjust OpacityNext, we will amend the x-axis. Right click on x-axis and select Edit Axis. We will edit the x-axis for the following:\r\nUnder the General pane, update range. Select radio button for fixed and amend start and end 0 and 1400 respectively.\r\nUpdate Title under Axis Titles to “Total Merchandise Trade (SGD Billions)”.\r\nUnder the Tick Marks pane, select radio button for fixed and amend Tick origin to begin at 0, and Tick Interval to 100.\r\n\r\nFigure 61: Update range and title of x-axisFigure 62: Update tick interval of x-axisUpdate the Legend Title by clicking on the small drop down arrow on the legend pane and selecting Edit Title. We will also hide the Region card given that we have already included Region as labels in the main bar chart. Click on the arrow next to legend title > select Hide Card (Figure 64).\r\nFigure 63: Update legend titleFigure 64: Hide Region legendClick on Label under Marks card. Select Most Recent under Marks to Label section. Tick the checkbox next to Allow labels to overlap other marks under Options section,\r\nFigure 65: Update labelsAlign fonts used in graph to Tableau Light. Adjust size of labels and legends to font size 9. Right click on the main chart pane > select format. In the sheets tab, adjust all fonts to Tableau Light.\r\nClick on Tooltip and update the tooltip fields to Figure 66 below.\r\nFigure 66: Edit TooltipRight click on the main chart pane > select format > click on the arrow next to Fields and select AGG(Running Total: Total Merchandise Trade). Under the Pane tab, under Default section, click on the dropdown next to Numbers and select Number (Custom), then update Decimal Places to 2. This is to align all tooltips to 2 decimal places.\r\nFigure 67: Format variables to 2 decimal placesAdd Title: “Ranking of Singapore’s Cumulative Merchandise Trade with Regions, 2011-2020”. Apply bolding, change font size to 12 and font to Tableau Light. Change font color to white. Right click on title pane > select Format Title > Under Title section, select blue next to Shading.\r\nFigure 68: Format TitleBubble chart\r\nDrag [Imports Aligned] and [Export Aligned] into Columns and Rows respectively.\r\nDrag [Region] into the Marks card and drop it under Color.\r\nCreate a new calculated field named [Total Merchandise Trade], with the below formula (Figure 69).\r\nFigure 69: Create calculated field- Total Merchandise TradeDrag [Export Aligned] into Columns. Right click on arrow next to field name and select Dual Axis. Synchronize the axis.\r\nFigure 70: Drag Export Aligned to Columns and synchronize axisRemove Measure Names and Sum(Total Merchandise Trade) from the All Marks card. Navigate to the Sum (Export Aligned) Marks card. Click on Size > Adjust the slider all the way to the left. Click on Color > Change Opacity to 0%.\r\nFigure 71: Change SizeFigure 72: Change OpacityRight click on the Bubble Chart > Select Trend Lines > Show Trend Lines > Sum(Export Aligned).\r\nFigure 73: Add 45 degree Trend LineDrag [Date] into the Pages pane and select Month format by clicking on the arrow next to Date.\r\nFigure 74: Drag Date to Pages pane and select Month formatNext, we will amend the y-axis. Right click on y-axis and select Edit Axis. We will edit the y-axis for the following:\r\nUnder the General pane, update range. Select radio button for fixed and amend start and end to 0 and 9 respectively.\r\nUpdate Title under Axis Titles to “Exports (SGD Billions)”.\r\nUnder the Tick Marks pane, select radio button for fixed and amend Tick Interval to 1.\r\n\r\nFigure 75: Update range and title of y-axisFigure 76: Update tick interval of y-axisNext, we will amend the x-axis. Right click on x-axis and select Edit Axis. We will edit the x-axis for the following:\r\nUnder the General pane, update range. Select radio button for fixed and amend start and end to 0 and 9 respectively.\r\nUpdate Title under Axis Titles to “Imports (SGD Billions)”.\r\nUnder the Tick Marks pane, select radio button for fixed and amend Tick origin to begin at 0, and Tick Interval to 1.\r\n\r\nFigure 77: Update range and title of x-axisFigure 78: Update tick interval of x-axisRight click on the Trend Line > Select Format > Under the Sheet Tab, under Trend Lines, select the broken line and a dark gray color for the Trend Lines. We will use broken lines and color to differentiate Trend Lines.\r\nFigure 79: Format Trend LinesDrag [Total Merchandise Trade] field into the Sum(Imports Aligned) Marks card and drop it under Size. Click on Size and adjust the slider as seen in Figure 80. Update the Mark Type to Circle and edit the Opacity to 50% (Figure 81). Click on the dropdown next to Border and select black color, as seen in Figure 81.\r\nFigure 80: Drop Total Merchandise Trade into Size in Marks card and adjust sizeFigure 81: Update Opacity and Border ColorRight click on the Export Aligned header at the top of the Bubble Chart and deselect Show Header.\r\nFigure 82: Hide Export Aligned HeaderUpdate the Legend Title by clicking on the small dropdown arrow on the legend pane and selecting Edit Title.\r\nFigure 83: Update legend title- MonthFigure 84: Update legend title- Total Merchandise TradeRight click on [Total Merchandise Trade] legend > select Edit Sizes > Select box next to Start Value in Legend and End Value in Legend and input 2 and 14 respectively > click ok.\r\nFigure 85: Edit SizeOn the animation window that appears on the right of the sheet (below Region), click on Show history option and click on the arrow next to Show history. Make the following selections:\r\nMarks to show history for: Change to All\r\nShow: Trails\r\nUnder Format section, click on dropdown and select the thinnest line\r\n\r\nFigure 86: Make the above animation selectionsFigure 87: Adjust trail history line sizeNext, we want to label each bubble with the region they are representing. We also want to align the color of the label to the bubble color. In order to do so, create a calculated field for each region with the formula as per Figure 88. Drag the calculated fields and drop them under Label in the Sum(Imports Aligned) Marks card.\r\nFigure 88: Create 10 new calculated fields with the above formula, updating for the relevant regionFigure 89: Drag label Calculated fields to LabelIn the Sum(Imports Aligned) Marks card, click on Label. Click on the “…” next to Text to edit labels. Align the colors in the Edit Label pane to the colors representing each region in the bubble chart. To do that, highlight the relevant region label and click on the arrow next to the color block at the top of the pane. Select More colors > Pick Screen Color. This will create a cursor which you can direct to the color representing each region in the Region legend. Click on the color in the Legend and this color will be applied to the selected region label. Apply bolding to the labels. After doing so, the Edit Label pane should look like Figure 90 below. Click ok, then select Allow labels to overlap other marks option under the Options section.\r\nFigure 90: Edit Label paneFigure 91: Edit Label OptionsDrag [Ranking- Net Exports/Imports] into Sum(Imports Aligned) Marks card under Tooltip. Click on arrow sign next to Ranking- Net Exports/Imports > select Edit Table Calculation > Select Compute Using Specific Dimensions > make the following selections as in Figure 92 below.\r\nFigure 92: Ranking Table CalculationClick on Tooltip under Sum(Imports Aligned) Marks card and edit Tooltips to align with Figure 93 below. Remove all variables from Tooltip under the Sum(Export Aligned) Marks card (Figure 94).\r\nFigure 93: Update Tooltip- Sum(Imports Aligned) Marks cardFigure 94: Update Tooltip- Sum(Export Aligned) Marks cardRight click on the main chart pane > select format > click on the arrow next to Fields and select the [Sum (Export Aligned)]. Under the Pane tab, click on the dropdown next to Numbers under Default section and select Number (Custom), then update Decimal Places to 2. This is to align all tooltips to 2 decimal places. Do the same for [Sum(Imports Aligned)] and [Total Merchandise Trade].\r\nFigure 95: Format variables to 2 decimal placesAlign fonts used in graph to Tableau Light. Adjust size of labels and legends to font size 9. Right click on the main chart pane > select format. In the sheets tab, adjust all fonts to Tableau Light.\r\nAdd Title and Commentary: “Singapore’s Exports, Imports and Net Trade Position with Regions”. Apply bolding, change font size to 12 and font to Tableau Light. Change font color to white. Right click on title pane > select Format Title > Under Title section, select blue next to Shading.\r\nFigure 96: Format TitleDashboard\r\nChange dashboard size to Automatic.\r\nFigure 97: Change Dashboard SizeArrange layout according to sketch. Drag and drop sheets into frame. Remove all legends except for Total Trade Merchandise (SGD Billions) and Trade Type. Click on the legend > click on the arrow next to the box > select floating and drag the box to the bubble chart and line chart as shown in Figure 98.\r\nFigure 98: Arranged layoutAdd source- Using Objects > Text > drag to bottom of dashboard and add: Source: Department of Statistics, Singapore (DOS) (https://www.singstat.gov.sg/) Change font size to 9, font to Tableau Light and color to black.\r\nAdd author- Using Objects > Text > drag to bottom right of dashboard and add: Dataviz Makeover 2| Stella Loh Change font size to 9, font to Tableau Light and color to black.\r\nAdd note- Using Objects > Text > drag to anywhere in dashboard and add: “Note: The European Union comprises Austria, Belgium, Bulgaria, Croatia, Cyprus, Czech Rep, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Ireland, Italy, Latvia, Lithuania, Luxembourg, Malta, Netherlands, Poland, Portugal, Romania, Slovak Rep, Slovenia, Spain and Sweden.” Change font size to 5, font to Tableau Light and color to black. Click on the text box > click on the arrow next to the box > select floating and drag the text box to the top left of bubble chart.\r\nAdd dashboard title- Using Objects > Text > drag to top of dashboard. Add title: “Singapore’s Trade with Regions, 2011-2020”. Adjust the title to be aligned in the middle, apply bolding, change font size to 15, font to Tableau Light, and change font color to white. Click on title and select the Layout tab on the left pane > Background > select a blue background for the dashboard title so that the title stands out.\r\nFigure 99: Format dashboard title backgroundNext, we will add the commentary to each chart added to the dashboard. Right click on the chart title > select Edit Title > Add commentary under the chart title. For the commentary, we will present them in Tableau Light font size 9, and white font color.\r\nWe will now add some highlight functions to the dashboard. Select Dashboard > Actions > Add Action. Update the Edit Highlight Action pane to the below. We want to be able to run the highlighting action on Hover and from any chart in the dashboard. Highlighted fields in the other charts will be based on Region.\r\nFigure 100: Update Edit Highlight Action paneAdd annotations. Right click on the bubble plot in the dashboard > select Annotate > Area. Add annotations indicating the areas for Net Exports and Net Imports. Apply bolding, change font to Tableau Light, font size to 10 and color to green/red for net exports and net imports respectively. For consistency, we will select the same shade of green/red as that used in the Red-Green diverging color scheme used in the line chart. Updated dashboard with annotations added should look like Figure 101.\r\nFigure 101: Add annotationsNext, we will customize the date slider. Right click on arrow next to the date container. Select Customize > Click on Show History Controls. This will remove the checkbox for Show History.\r\nFigure 102: Add annotationsNote: We have decided not to utilize the simultaneous style animation offered in Tableau Desktop. Utilizing this style would not allow us to see the history of net trade in the line charts, which offers users insights into how the net trade for each region is trending.\r\n6. Observations\r\nOne way to study Singapore’s trade patterns with various trading partners is to track how net trade changes across time. The above dashboard does this by plotting Singapore’s exports, imports, net trade and cumulative merchandise trade with various regions, for the period 2011-2020.\r\nThis dashboard consists of three charts:\r\nBubble chart showing each region’s export and import and how they compare with one another at each point in time. It also gives an idea on the net trade position (trade surplus/ trade deficit) with each region.\r\nLine graph showing exports, imports and net trade over time.\r\nBar chart showing the ranking of cumulative total merchandise trade with each region. This allows users to see how trade volume with each region changes.\r\nUsers are also able to explore the trends for a specific region by hovering over the region in any of the charts and the corresponding region will be highlighted across all three charts in the dashboard.\r\nWe have derived the following insights from the dashboard presented:\r\nImports from Taiwan reached a new high in Dec’20 (S$4.91 billion) and has been on a steady uptrend in 2020. Although exports to Taiwan has also reached a new high in Dec’20 (S$2.73 billion), the rate of increase in imports exceeds that of exports in 2020, resulting in a growing trade deficit with Taiwan. This can be observed from the steeper slope of the import line compared to export line in 2020.  A possible reason for the increase in imports could be due to the Covid-19 pandemic. Taiwan was able to successfully control the pandemic as compared to some of Singapore’s other trade partners. Hence some of the imports may have been diverted to Taiwan.\r\nFigure 103: Taiwan line chartBoth exports and imports from Malaysia saw a steep decline in Apr’20 and rebounded strongly in Jun’20. This may be due to the circuit breaker and MCO period in Singapore and Malaysia respectively where citizens were encouraged to stay home and many shops were closed for business, resulting in lower imports by both Singapore and Malaysia. The circuit breaker period in Singapore began in Apr’20 and measures were relaxed in Jun’20, which coincides with the strong rebound in imports.  Singapore has consistently been in a net trade deficit with Malaysia since early 2020. Singapore imports over 90% of the food consumed in the country and hence the lack of transportation options, coupled with the severity of the pandemic in some of the trading partners, may have resulted in increased imports from Malaysia due its geographical proximity.\r\nFigure 104: Malaysia line chartSingapore’s net trade deficit with United States has been showing a decreasing trend since Aug’19, and eventually becoming a net trade surplus for most of 2020. This is due to declining imports, with the largest decline (S$1.45 billion) between Mar’20 and May’20. We also see an increasing trend for exports to United States with a steady increase since Feb’17 and peaking in Jul’20 (S$5.94 billion).\r\nFigure 105: United States line chartWe have also observed a declining trade deficit with Europe, brought about by declining imports. Imports peaked in Jul’18 (S$8.69 billion) and has seen a downtrend since. We noticed a sharp dip in imports between May’19 to Jun’19 (S$7.99 billion to S$6.05 billion), before recovering slightly and another sharp dip between Jan’20 to May’20 (S$6.86 billion to S$4.63 billion). This may be due to heightened pandemic measures leading to the circuit breaker period in Singapore. As most shops were closed during this period and citizens were encouraged to stay in, this may have reduced demand for machinery and vehicles, which are the main imports from Europe.  We also noticed that net trade deficit with Europe forms a double hump pattern- increasing steadily from 2011 and peaking in Oct’13 (-S$4.37 billion), then steadily declining to a low in May’16. This is followed by a steady increase and peaking once more in Jul’18 (-S$4.52 billion) and downtrend till Sep’20.\r\nFigure 106: Europe line chartThe bubble chart shows the trending for each region’s exports and imports over the past ten years. We are able to see the patterns that each region makes over the period, namely:\r\nExports to Hong Kong over the past 10 years has hovered around S$3.9 to S$6.4 billion, while imports have consistently remained below S$1 billion. Hence, Singapore’s net trade balance with Hong Kong consistently ranks top out of the ten regions included in this analysis.\r\nTrade with Korea and United States has turned from net imports to net exports. Exports to United States are increasing at a faster rate compared to imports. This can be seen from the trail history whereby there is a big shift upward compared to rightward movement.\r\nChina has been moving towards the upper right corner of the bubble chart across the ten years, indicating growing exports and imports. Exports to China have overtaken Malaysia, which used to be the top export country in Jan’11. Imports from China also show signs of overtaking Europe.\r\nValue of imports from Europe have consistently ranked the top. However, imports from China is on a growing trend (moving right on bubble chart) and has potential to overtake Europe.\r\nTrade with Malaysia has moved from net exports to net imports. This is mainly due to decreasing exports and increasing imports (downward and rightward movement in bubble chart).\r\nImports from Taiwan are increasing at a faster rate compared to exports. This can be seen from the trail history whereby there is a big shift to the right compared to the move up.\r\nSingapore is mostly in trade deficit with Japan, with the exception of a few months.\r\nThailand saw a sharp increase in imports in Apr’20, and increase in exports in Mar’20, both which lasted for a month before seeing a sharp decline the following month.\r\nExports to Indonesia is declining at a faster rate compared to imports. This can be seen from the trail history whereby there is a big shift down compared to leftward movement.\r\n\r\nFigure 107: Insights from bubble chartSingapore’s net trade balance with Indonesia is on a declining trend across the 10 years, mainly brought about by declining exports. Exports peaked in Jul’13 (S$5.49 billion) and has been generally downtrend since. This is consistent with what we observed in the bubble chart where exports are declining at a faster rate compared to imports. Singapore’s main exports to Indonesia are refined petroleum, petrochemicals and telecommunications equipment.\r\nFigure 108: Indonesia line chartSingapore’s trade deficit with Republic of Korea has turned to a consistent trade surplus since 2018. This is mainly due to declining imports while exports have remained relatively consistent. Imports peaked in Nov’12 (S$3.52 billion) and has been generally downtrend since.\r\nFigure 109: Korea line chartSharp increase in exports to Thailand from S$1.70 billion to S$2.51 billion between Feb’20 to Mar’20, followed by a steep decline till May’20 (S$2.51 billion to S$1.22 billion). We see a similar spike in imports from Thailand from S$1.09 billion to S$1.98 billion between Mar’20 and Apr’20, followed by a sharp decline to S$0.80 billion in Jun’20. Main exports and imports from Thailand is refined petroleum. Weak refining margins may have prompted Thai refiners to lower crude import volumes in May’20, coinciding with the drop in exports observed.\r\nFigure 110: Thailand line chartSharp decline in exports and imports to/from Mainland China observed between Dec’19 to Feb’20. Exports decreased from S$7.00 billion to S$3.91 billion while imports reduced from S$5.99 billion to S$3.98 billion. This decline coincides with the lockdown in certain Chinese cities due to the severity of the pandemic.  Imports quickly rebounded to S$5.98 billion in Mar’20 while exports only showed a rebound and new high following Jul’20. Exports to Mainland China increased sharply between Jul’20 (S$5.40 billion) to Aug’20 (S$7.97 billion) and has been maintaining at a higher range since then. This may be due to China being one of the first countries to recover economically from the pandemic. China’s economy picked up speed in the fourth quarter of 2020, with growth beating expectations. This may explain the increase in exports to China during the second half of 2020.\r\nFigure 111: China line chartMainland China has overtaken Malaysia to rank second highest in terms of cumulative merchandise trade over the period, since Apr’15. It has been able to widen the gap between second and third place since. United States has overtaken Indonesia to rank forth in terms of cumulative merchandise trade over the period, since Oct’15.\r\nFigure 112: Cumulative Merchandise Trade Bar Chart\r\n\r\n\r\n",
    "preview": "posts/2021-06-08-dataviz-makeover2/Image/finalviz.JPG",
    "last_modified": "2021-06-20T20:02:43+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-05-24-dafaviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "DataViz Makeover 1 for ISSS608: Visual Analytics",
    "author": [
      {
        "name": "Stella Loh",
        "url": "https://www.linkedin.com/in/stella-loh-308b72129/"
      }
    ],
    "date": "2021-05-30",
    "categories": [
      "dataviz_makeover",
      "trellis",
      "line graph"
    ],
    "contents": "\r\n1. Original Visualisation\r\nFigure 1: Original visualisationData Source\r\nThe data visualisation above is created by using data provided by Department of Statistics, Singapore (DOS).\r\n2. Critiques\r\n2.1 Clarity\r\nChart title is not aligned with the chart content- Title reads as “Merchandise Trade of Top Six Trading Countries, 2019-2020”. However, chart for Japan only reflects 2020 data.\r\nChart axis is misleading-\r\ny-axis scale differs across each country’s chart. This makes the charts not comparable at first glance, and will mislead users who do not read the graph in detail.\r\nCharts have dual y-axis for imports and exports. The scales for imports and exports within each country’s chart are not synchronized and hence have different ranges. This makes it difficult to compare whether a country is in net export/ import position. This may also be misleading to users who do not read the graph in detail, as they may assume net export/import position simply by seeing the area under the line.\r\n\r\nChart did not specify criteria for which top 6 trading partners is chosen- Considerations such as assessed period and criteria being considered (net trade balance/ import/ export or consider each separately) are not specified. Since the selection criteria is not specified in the chart, we cannot make assumptions on the criteria in this Dataviz exercise. Hence, we should avoid mentioning “top six” in the title.\r\nPresentation may not be the most appropriate depending on what the author is trying to show-\r\nComparing import and export across time and across countries- since the x-axis and y-axis are not synchronized across each country’s chart, users are unable to do a simple comparison of the area under the line across the charts, for each month.\r\nComparing net import/ export across time for each country- additional mental subtraction (as scales are not synchronized) and assessment of area under the line required by user to arrive at net export/import for each period.\r\n\r\nNo commentary provided- reader does not have commentary to understand the main idea of the visualisation.\r\nDoes not include data source- reader is unable to verify the data, nor replicate the chart using source data.\r\nDoes not specify measurement currency- reader will not know if figures for each country is measured in the same currency. This can be included in the axis information.\r\n2.2 Aesthetics\r\nDifferent alignments of x-axis- charts of various thickness makes the entire visualisation look disorganised. User is also unable to make a meaningful assessment across each country’s chart for each time period given that the x-axis is not aligned.\r\nChart title vs country name font size- Font size of title should be larger than the country name as the title will introduce to the user what the chart is about.\r\nAnnotations are not used to convey points, leaving the reader to infer the purpose of the graph.\r\nPoor use of colors in the chart- use of area chart with overlap of colors makes it difficult to read.\r\nNo tick marks for y-axis values even though it’s on a continuous scale.\r\nLegend title has been left as default (Measure Names), instead of being renamed into something more intuitive and clear to the user.\r\n3. Proposed Design\r\nSketch\r\nFigure 2: Sketch of proposed designAdvantages of proposed design\r\n3.1 Clarity\r\nChart title is aligned with the chart content- chart shows only the relevant periods as aligned with title.\r\nChart axis is aligned across all 6 countries-\r\ny-axis scale is aligned across each country’s chart.\r\nCharts have synchronized axis for imports, exports and net exports/imports.\r\nx-axis width and scale is aligned across each country’s chart.\r\n\r\nProposed chart shows exports, imports and net exports/imports across time for each country- users are able to identify trends across time for the three variables. This also reduces the need for users to manually compute the net export/import.\r\nChart title provides audience with the big picture, followed by short commentary to provide more context.\r\nData source is included in chart.\r\nReference line is added for user to easily identify the demarcation between 2019 and 2020, allowing the user to eyeball the line and bar charts to assess for seasonality effects. Color and line type of reference line is chosen so as to avoid distracting the user.\r\nMeasurement currency is specified in the axis so reader will know at one glance.\r\n3.2 Aesthetics\r\nx-axis is aligned across each country’s chart- this makes the visualisation more organised and allows users to compare the trends across time for each country.\r\nFont size for chart title, commentary and chart annotations have been adjusted so as not to divert reader’s attention.\r\nColors are consistent throughout the dashboard with clear legend on what they represent. Minimal overlapping of colors.\r\nTick marks added to y-axis scale. Soft gridlines have also been added to the chart to provide reference but not to distract users.\r\nAnnotations added to convey points, which includes computation of year-on-year difference in export and imports. This allows users to see at a glance, the trending for exports/ imports.\r\nDefault legend title has been renamed to be more representative and clear to the user.\r\n4. Final Visualisation\r\n4.1 Snapshot of dashboard\r\nFigure 3: Snapshot of dashboard- full visualisation available at Tableau Public5. Data Visualisation Steps\r\nAfter downloading the data, select data for the relevant countries from each dataset (import and export dataset) and paste into a new sheet using Microsoft Excel.\r\nFigure 4: Extract relevant dataTranspose the extracted import and export data, naming the date column as “Date” and value column as “Imports” or “Exports”.\r\nFigure 5: Transposed dataCombine the transposed import and export data.\r\nFigure 6: Combined dataPerform the following actions and save the manipulated data set as “data_clean”.\r\nNo\r\nVariable\r\nAction\r\n1\r\nVariables\r\nRename column as “Country”\r\n2\r\nVariables\r\nRemoved “(Thousand Dollars)” from value\r\n3\r\nImports\r\nRename column as “Imports (S$’000)”\r\n4\r\nExports\r\nRename column as “Exports (S$’000)”\r\nFigure 7: Rename columnsImport the data into Tableau.\r\nFigure 8: Import data into tableauChange data type- change Date data type to “Date”. Remove ($’000) from [Exports($’000)] and [Imports($’000)] as we will be indicating this in the axis information later.\r\nFigure 9: Update data sourceAs we will be presenting the charts for six countries in the form of a trellis, we have to create two calculated fields called “x-axis” and “y-axis”.\r\nCreate a new calculated field and name it “x-axis”, with the below formula (Figure 11).\r\nCreate another calculated field named “y-axis”, with the below formula (Figure 12).\r\n\r\nFigure 10: Create calculated fieldFigure 11: x-axis formulaFigure 12: y-axis formulaDrag [Date] to columns and change selection to month. Change data type to continuous.\r\nFigure 13: Drag date to columnsDrag [Exports($’000)] to rows, then drag [Imports($’000)] and drop it into the chart as seen in Figure 14 below. This creates a Measure Values shelf that appears in the data pane and contains all the measures of the data collected into one field.\r\nFigure 14: Drag exports and imports to rowsDrag the calculated fields [x-axis] and [y-axis] to Columns and Rows respectively. Convert both fields into discrete fields.\r\nFigure 15: Update fieldsDrag [Country] into the Marks card under detail.\r\nFigure 16: Drag country into detailEdit table calculation for both [x-axis] and [y-axis] calculated fields. Select computation using Specific Dimensions- by [Country] then by [Month of Date], at the level of [Country].\r\nFigure 17: Edit table calculation for x-axis and y-axis fieldsCreate another calculated field named [Net exports/imports], with the below formula.\r\nFigure 18: Net export/import calculated fieldDrag [Net exports/imports] into Rows and select dual axis. Right click on the axis and select synchronize axis (Figure 19).\r\nFigure 19: Synchronize axisOn the Marks card for [net exports/imports], click the Mark Type drop-down and select bar.\r\nFigure 20: Change mark type to barDrag [net exports/imports] to Color on the Marks card. On the Marks card, click Color > Edit Colors.\r\nUpdate stepped color option to 2 steps as we want to show negative and positive values in different colors.\r\nClick on the drop down under palette and select the red-green diverging option (Figure 21).\r\nAdjust the slider under opacity to 50% (Figure 22).\r\n\r\nFigure 21: Change colorsFigure 22: Adjust opacityHide the below axis headers and field labels by deselecting Show Header and selecting hide field labels respectively.\r\nFigure 23: Hide headerFigure 24: Hide headerFigure 25: Hide field label for columnsNow that we have created the trellis, we will move on to add labels to each panel. We want to show the % change in exports and imports year-on-year. Hence we will create four new calculated fields, [Sum Export Y-O-Y], [Sum Import Y-O-Y], [Export Diff Calculation], [Import Diff Calculation]. Formulas are shown below:\r\nFigure 26: Create Sum Export Y-O-Y calculated fieldFigure 27: Create Sum Import Y-O-Y calculated fieldFigure 28: Create Export Diff Calculation calculated fieldFigure 29: Create Import Diff Calculation calculated fieldDrag [Export Diff Calculation] and [Import Diff Calculation] into the Measure Values Marks card and drop it into Label. This will label the [Exports] and [Imports] line graph within each panel in the trellis. Click on Label and select Line Ends option, so labels will appear at the end of the line graph, to avoid cluttering the graph with labels.\r\nFigure 30: Label panelsAs we only need one label instead of two as seen in Figure 30 above, we will proceed to right click on the import line graph label and select Mark Label > Never Show. Now we are left with one label for each panel. Align the label to top right corner of each panel.\r\nFigure 31: Hide label for import line graphNext, we want to add a label to indicate which country each panel is representing. Drag [Country] into the Sum(Net exports/imports] Marks card, under Label. Click on Label and select Most Recent option, so labels will appear at the end of the bar chart, to avoid cluttering the graph with labels. Move the label to the top left of each panel and bold it to make it more visible to users.\r\nFigure 32: Align country label to top left of each panelNext, we will amend the y-axis. Right click on y-axis and select Edit Axis. We will edit the y-axis for the following:\r\nUnder the General pane, update range. Select radio button for fixed and amend start and end to -3,000,000 and 8,500,000 respectively.\r\nUpdate Title under Axis Titles to “Singapore Dollars ($’000)”.\r\nUnder the Tick Marks pane, select radio button for fixed and amend Tick Interval to 2,000,000.\r\n\r\nFigure 33: Update range and title of y-axisFigure 34: Update tick interval of y-axisNext, we will amend the x-axis. Right click on x-axis and select Edit Axis. We will edit the x-axis for the following:\r\nUnder the General pane, update range. Select radio button for fixed and amend start and end to 1/12/2018 and 31/1/2021 respectively. This is to provide a small gap at the start and end of each trellis panel. Next, uncheck Show times.\r\nUpdate Title under Axis Titles to “Month”.\r\nUnder the Tick Marks pane, select radio button for fixed and amend Tick origin to begin at 1/1/2019, and Tick Interval to 6 months.\r\n\r\nFigure 35: Update range and title of x-axisFigure 36: Update tick interval of x-axisUpdate the Legend Title by clicking on the small drop down arrow on the legend pane and selecting Edit Title.\r\nNo\r\nOriginal Title\r\nUpdated Title\r\n1\r\nMeasure Names\r\nTrade Type\r\n2\r\nSum(Net Exports/Imports)\r\nNet Exports/Imports\r\nFigure 37: Update legend titleFigure 38: Update legend titleCreate two calculated fields [Net export position] and [Net import position], with the formulas shown in Figure 39 and Figure 40 respectively. Drag these two fields into the Sum(Net exports/imports) Marks card under Tooltip.\r\nFigure 39: Create Net export position calculated fieldFigure 40: Create Net import position calculated fieldClick on Tooltip > Insert the above calculated fields under Net exports/imports and color <AGG(Net export position)> and <AGG(Net import position)> green and red respectively (Figure 41). Edit Tooltip in the Measure Values Marks card (Figure 42).\r\nFigure 41: Edit Tooltip for Sum(Net Exports/Imports) Marks cardFigure 42: Edit Tooltip for Measure Values Marks cardAlign fonts used in graph to Tableau Light. Adjust size of labels and legends to font size 9.\r\nSort trellis by [Exports($’000)]. Under Measure Values Marks card, Select [Country] > Sort > Sort by Field > Descending order > Input Field Name as “Exports($’000)” > Select Sum under Aggregation. This sorts the trellis panel by exports across the six countries.\r\nFigure 43: Sort by exportsAdd commentary: “Exports to the six trading partners have increased 2.0%, while imports have reduced 2.8%. There does not appear to be a seasonality effect for both exports and imports.” Apply bold effect to the percentages to accentuate them.\r\nAdd reference line to the x-axis. Right click on x-axis > select scope as Per Pane > change value type to constant and choose 1 Jan 2020 > Change Label to none and Tooltip to automatic. We also update the reference line formatting by selecting a thinner, dotted line and grey color, so as to differentiate it from the other gridlines in the chart. The reference line allows users to better segregate between both years, for each panel.\r\nFigure 44: Add Reference Line5.1 Dashboard\r\nAdd sheets into dashboard- Drag the “Singapore’s Trade with 6 countries” sheet into the dashboard.\r\nAdd dashboard title- Using Objects > Text > drag to top of dashboard. Add title: “Singapore’s Merchandise Trade with Six Trading Countries, 2019-2020”. Adjust the title to be aligned in the middle. Click on title and select the Layout tab > Background > select a grey background and white font for the dashboard title so that the title stands out from the rest of the graph.\r\nAdd source- Using Objects > Text > drag to bottom of dashboard and add: Source: Department of Statistics, Singapore (DOS) (https://www.singstat.gov.sg/) The raw data: https://www.singstat.gov.sg/find-data/search-by-theme/trade-and-investment/merchandise-trade/latest-data\r\nAdd author- Using Objects > Text > drag to bottom right of dashboard and add: Dataviz Makeover 1| Stella Loh\r\n6. Observations\r\nThere does not appear to be a seasonality pattern in the exports and imports across both years (2019 and 2020), across the six countries.\r\nHong Kong and Taiwan have remained consistently in the net export and net import position respectively.\r\nSingapore’s net trade with Malaysia is becoming increasing negative (net import position) in 2020, as compared to 2019. This is mainly due to declining exports to Malaysia. Exports have reduced 18.2% Y-O-Y while imports have increased 1.2% Y-O-Y.\r\nConversely, Singapore’s net trade with United States is becoming increasing positive (net export position) in 2020, as compared to 2019. This is mainly due to increasing exports to United States. Exports have increased 19.3% Y-O-Y while imports have reduced 19.0% Y-O-Y, making Singapore a net exporter for most of 2020.\r\nImports from Hong Kong are significantly lower than the other five countries.\r\nExports and imports to/ from Japan remain relatively stable over both years. Both exports and imports with Japan are relatively close and hence the net export or import position is small.\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-05-24-dafaviz-makeover-1/Image/finalviz.JPG",
    "last_modified": "2021-06-10T01:29:07+08:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome!",
    "description": "Welcome to my blog. I will be updating this blog with Dataviz projects I have undertaken. Feel free to contact me via [email](mailto:stellaloh91@gmail.com) with any comments!",
    "author": [
      {
        "name": "Stella Loh",
        "url": "https://www.linkedin.com/in/stella-loh-308b72129/"
      }
    ],
    "date": "2021-05-23",
    "categories": [
      "welcome"
    ],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": "posts/welcome/Image/data.jpeg",
    "last_modified": "2021-05-24T23:21:50+08:00",
    "input_file": {}
  }
]
