[
  {
    "path": "posts/2021-05-24-dafaviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "DataViz Makeover 1 for ISSS608: Visual Analytics",
    "author": [
      {
        "name": "Stella Loh",
        "url": "https://www.linkedin.com/in/stella-loh-308b72129/"
      }
    ],
    "date": "2021-05-24",
    "categories": [
      "dataviz_makeover"
    ],
    "contents": "\r\n1. Original Visualisation\r\nFigure 1: Original visualisationData Source\r\nThe data visualisation above is created by using data provided by Department of Statistics, Singapore (DOS).\r\n2. Critiques\r\n2.1 Clarity\r\nChart title is not aligned with the chart content- Title reads as “Merchandise Trade of Top Six Trading Countries, 2019-2020”. However, chart for Japan only reflects 2020 data.\r\nChart axis is misleading-\r\ny-axis scale differs across each country’s chart. This will mislead users who do not read the graph in detail.\r\nCharts have dual y-axis for imports and exports. The scales for imports and exports within each country’s chart are not synchronized and hence have different ranges. This makes it difficult to compare whether a country is in net export/ import position. This may also be misleading to users who do not read the graph in detail.\r\n\r\nChart did not specify criteria for which top 6 trading partners is chosen.- Some considerations include: (a) Across which period, and (b) What is being considered- net trade import/ export or consider each separately?\r\nPresentation may not be the most appropriate depending on purpose of what the author is trying to show-\r\nComparing import and export across time for each country, or\r\nComparing net import/ export across time for each country.\r\n\r\nNo commentary provided- reader does not have commentary to understand the main idea of the visualisation.\r\nDoes not include data source- reader is unable to verify the data, nor replicate the chart using source data.\r\n2.2 Aesthetics\r\nDifferent alignments of x-axis- charts of various thickness makes the entire visualisation look disorganised.\r\nChart title vs country name font size- Font size of title should be larger than the country name.\r\nDoes not specify measurement currency- reader will not know if figures for each country is measured in the same currency. This can be included in the axis information.\r\nAnnotations are not used to convey points, leaving the reader to infer the purpose of the graph.\r\nPoor use of colors in the chart- use of area chart with overlap of colors makes it difficult to read.\r\nNo tick marks for y-axis values even though it’s on a continuous scale.\r\n3. Proposed Design\r\nSketch\r\nFigure 2: Sketch of proposed designAdvantages of proposed design\r\n3.1 Clarity i. Chart title is aligned with the chart content- chart shows only the relevant periods as aligned with title.\r\nChart axis is aligned across all 6 countries-\r\ny-axis scale is aligned across each country’s chart.\r\nCharts have synchronized axis for imports and exports.\r\n\r\nProposed chart shows exports, imports and net exports/imports across time for each country- users are able to identify trends across time for both exports and imports. This also reduces the need for users to manually compute the net export/import.\r\nChart title provides audience with the big picture, followed by short commentary to provide more context.\r\nData source is included in chart.\r\n3.2 Aesthetics\r\nx-axis is aligned across each country’s chart- this makes the visualisation more organised and allows users to compare the trends across time for each country.\r\nFont size for chart title, commentary and chart annotations have been adjusted so as not to divert reader’s attention.\r\nMeasurement currency is specified in the axis so reader will know at one glance.\r\nAnnotations added to convey points.\r\nColors are consistent throughout the dashboard with clear legend on what they represent. Minimal overlapping of colors.\r\nTick marks added to y-axis scale. Soft gridlines have also been added to the chart to provide reference but not to distract users.\r\n4. Data Visualisation Steps\r\nAfter downloading the data, select data for the relevant countries from each dataset (import and export dataset) and paste into a new sheet using Microsoft Excel.\r\nFigure 3: Extract relevant dataTranspose the extracted import and export data, naming the date column as “Date” and value column as “Imports”/ “Exports” respectively.\r\nFigure 4: Transposed dataCombine the transposed import and export data.\r\nFigure 5: Combined dataPerform the following actions:\r\nNo\r\nVariable\r\nAction\r\n1\r\nVariables\r\nRename column as “Country”\r\n2\r\nVariables\r\nRemoved “(Thousand Dollars)” from value\r\n3\r\nImports\r\nRename column as “Imports (S\\('000)\" 4 |Exports | Rename column as \"Exports (S\\)’000)”\r\nFigure 6: Rename columnsFinal Visualisation\r\nObservations\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-26T17:57:15+08:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome!",
    "description": "Welcome to my blog. I will be updating this blog with Dataviz projects I have undertaken. Feel free to contact me via [email](mailto:stellaloh91@gmail.com) with any comments!",
    "author": [
      {
        "name": "Stella Loh",
        "url": "https://www.linkedin.com/in/stella-loh-308b72129/"
      }
    ],
    "date": "2021-05-23",
    "categories": [
      "welcome"
    ],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": "posts/welcome/Image/data.jpeg",
    "last_modified": "2021-05-24T23:21:50+08:00",
    "input_file": {}
  }
]
