[
  {
    "path": "posts/2021-05-24-dafaviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "DataViz Makeover 1 for ISSS608: Visual Analytics",
    "author": [
      {
        "name": "Stella Loh",
        "url": "https://www.linkedin.com/in/stella-loh-308b72129/"
      }
    ],
    "date": "2021-05-30",
    "categories": [
      "dataviz_makeover",
      "trellis",
      "line graph"
    ],
    "contents": "\r\n1. Original Visualisation\r\nFigure 1: Original visualisationData Source\r\nThe data visualisation above is created by using data provided by Department of Statistics, Singapore (DOS).\r\n2. Critiques\r\n2.1 Clarity\r\nChart title is not aligned with the chart content- Title reads as “Merchandise Trade of Top Six Trading Countries, 2019-2020”. However, chart for Japan only reflects 2020 data.\r\nChart axis is misleading-\r\ny-axis scale differs across each country’s chart. This makes the charts not comparable at first glance, and will mislead users who do not read the graph in detail.\r\nCharts have dual y-axis for imports and exports. The scales for imports and exports within each country’s chart are not synchronized and hence have different ranges. This makes it difficult to compare whether a country is in net export/ import position. This may also be misleading to users who do not read the graph in detail, as they may assume net export/import position simply by seeing the area under the line.\r\n\r\nChart did not specify criteria for which top 6 trading partners is chosen- Considerations such as assessed period and criteria being considered (net trade balance/ import/ export or consider each separately) are not specified. Since the selection criteria is not specified in the chart, we cannot make assumptions on the criteria in this Dataviz exercise. Hence, we should avoid mentioning “top six” in the title.\r\nPresentation may not be the most appropriate depending on what the author is trying to show-\r\nComparing import and export across time and across countries- since the x-axis and y-axis are not synchronized across each country’s chart, users are unable to do a simple comparison of the area under the line across the charts, for each month.\r\nComparing net import/ export across time for each country- additional mental subtraction (as scales are not synchronized) and assessment of area under the line required by user to arrive at net export/import for each period.\r\n\r\nNo commentary provided- reader does not have commentary to understand the main idea of the visualisation.\r\nDoes not include data source- reader is unable to verify the data, nor replicate the chart using source data.\r\nDoes not specify measurement currency- reader will not know if figures for each country is measured in the same currency. This can be included in the axis information.\r\n2.2 Aesthetics\r\nDifferent alignments of x-axis- charts of various thickness makes the entire visualisation look disorganised. User is also unable to make a meaningful assessment across each country’s chart for each time period given that the x-axis is not aligned.\r\nChart title vs country name font size- Font size of title should be larger than the country name as the title will introduce to the user what the chart is about.\r\nAnnotations are not used to convey points, leaving the reader to infer the purpose of the graph.\r\nPoor use of colors in the chart- use of area chart with overlap of colors makes it difficult to read.\r\nNo tick marks for y-axis values even though it’s on a continuous scale.\r\nLegend title has been left as default (Measure Names), instead of being renamed into something more intuitive and clear to the user.\r\n3. Proposed Design\r\nSketch\r\nFigure 2: Sketch of proposed designAdvantages of proposed design\r\n3.1 Clarity\r\nChart title is aligned with the chart content- chart shows only the relevant periods as aligned with title.\r\nChart axis is aligned across all 6 countries-\r\ny-axis scale is aligned across each country’s chart.\r\nCharts have synchronized axis for imports, exports and net exports/imports.\r\nx-axis width and scale is aligned across each country’s chart.\r\n\r\nProposed chart shows exports, imports and net exports/imports across time for each country- users are able to identify trends across time for the three variables. This also reduces the need for users to manually compute the net export/import.\r\nChart title provides audience with the big picture, followed by short commentary to provide more context.\r\nData source is included in chart.\r\nReference line is added for user to easily identify the demarcation between 2019 and 2020, allowing the user to eyeball the line and bar charts to assess for seasonality effects. Color and line type of reference line is chosen so as to avoid distracting the user.\r\nMeasurement currency is specified in the axis so reader will know at one glance.\r\n3.2 Aesthetics\r\nx-axis is aligned across each country’s chart- this makes the visualisation more organised and allows users to compare the trends across time for each country.\r\nFont size for chart title, commentary and chart annotations have been adjusted so as not to divert reader’s attention.\r\nColors are consistent throughout the dashboard with clear legend on what they represent. Minimal overlapping of colors.\r\nTick marks added to y-axis scale. Soft gridlines have also been added to the chart to provide reference but not to distract users.\r\nAnnotations added to convey points, which includes computation of year-on-year difference in export and imports. This allows users to see at a glance, the trending for exports/ imports.\r\nDefault legend title has been renamed to be more representative and clear to the user.\r\n4. Final Visualisation\r\n4.1 Snapshot of dashboard\r\nFigure 3: Snapshot of dashboard- full visualisation available at Tableau Public5. Data Visualisation Steps\r\nAfter downloading the data, select data for the relevant countries from each dataset (import and export dataset) and paste into a new sheet using Microsoft Excel.\r\nFigure 4: Extract relevant dataTranspose the extracted import and export data, naming the date column as “Date” and value column as “Imports” or “Exports”.\r\nFigure 5: Transposed dataCombine the transposed import and export data.\r\nFigure 6: Combined dataPerform the following actions and save the manipulated data set as “data_clean”.\r\nNo\r\nVariable\r\nAction\r\n1\r\nVariables\r\nRename column as “Country”\r\n2\r\nVariables\r\nRemoved “(Thousand Dollars)” from value\r\n3\r\nImports\r\nRename column as “Imports (S$’000)”\r\n4\r\nExports\r\nRename column as “Exports (S$’000)”\r\nFigure 7: Rename columnsImport the data into Tableau.\r\nFigure 8: Import data into tableauChange data type- change Date data type to “Date”. Remove ($’000) from [Exports($’000)] and [Imports($’000)] as we will be indicating this in the axis information later.\r\nFigure 9: Update data sourceAs we will be presenting the charts for six countries in the form of a trellis, we have to create two calculated fields called “x-axis” and “y-axis”.\r\nCreate a new calculated field and name it “x-axis”, with the below formula (Figure 11).\r\nCreate another calculated field named “y-axis”, with the below formula (Figure 12).\r\n\r\nFigure 10: Create calculated fieldFigure 11: x-axis formulaFigure 12: y-axis formulaDrag [Date] to columns and change selection to month. Change data type to continuous.\r\nFigure 13: Drag date to columnsDrag [Exports($’000)] to rows, then drag [Imports($’000)] and drop it into the chart as seen in Figure 14 below. This creates a Measure Values shelf that appears in the data pane and contains all the measures of the data collected into one field.\r\nFigure 14: Drag exports and imports to rowsDrag the calculated fields [x-axis] and [y-axis] to Columns and Rows respectively. Convert both fields into discrete fields.\r\nFigure 15: Update fieldsDrag [Country] into the Marks card under detail.\r\nFigure 16: Drag country into detailEdit table calculation for both [x-axis] and [y-axis] calculated fields. Select computation using Specific Dimensions- by [Country] then by [Month of Date], at the level of [Country].\r\nFigure 17: Edit table calculation for x-axis and y-axis fieldsCreate another calculated field named [Net exports/imports], with the below formula.\r\nFigure 18: Net export/import calculated fieldDrag [Net exports/imports] into Rows and select dual axis. Right click on the axis and select synchronize axis (Figure 19).\r\nFigure 19: Synchronize axisOn the Marks card for [net exports/imports], click the Mark Type drop-down and select bar.\r\nFigure 20: Change mark type to barDrag [net exports/imports] to Color on the Marks card. On the Marks card, click Color > Edit Colors.\r\nUpdate stepped color option to 2 steps as we want to show negative and positive values in different colors.\r\nClick on the drop down under palette and select the red-green diverging option (Figure 21).\r\nAdjust the slider under opacity to 50% (Figure 22).\r\n\r\nFigure 21: Change colorsFigure 22: Adjust opacityHide the below axis headers and field labels by deselecting Show Header and selecting hide field labels respectively.\r\nFigure 23: Hide headerFigure 24: Hide headerFigure 25: Hide field label for columnsNow that we have created the trellis, we will move on to add labels to each panel. We want to show the % change in exports and imports year-on-year. Hence we will create four new calculated fields, [Sum Export Y-O-Y], [Sum Import Y-O-Y], [Export Diff Calculation], [Import Diff Calculation]. Formulas are shown below:\r\nFigure 26: Create Sum Export Y-O-Y calculated fieldFigure 27: Create Sum Import Y-O-Y calculated fieldFigure 28: Create Export Diff Calculation calculated fieldFigure 29: Create Import Diff Calculation calculated fieldDrag [Export Diff Calculation] and [Import Diff Calculation] into the Measure Values Marks card and drop it into Label. This will label the [Exports] and [Imports] line graph within each panel in the trellis. Click on Label and select Line Ends option, so labels will appear at the end of the line graph, to avoid cluttering the graph with labels.\r\nFigure 30: Label panelsAs we only need one label instead of two as seen in Figure 30 above, we will proceed to right click on the import line graph label and select Mark Label > Never Show. Now we are left with one label for each panel. Align the label to top right corner of each panel.\r\nFigure 31: Hide label for import line graphNext, we want to add a label to indicate which country each panel is representing. Drag [Country] into the Sum(Net exports/imports] Marks card, under Label. Click on Label and select Most Recent option, so labels will appear at the end of the bar chart, to avoid cluttering the graph with labels. Move the label to the top left of each panel and bold it to make it more visible to users.\r\nFigure 32: Align country label to top left of each panelNext, we will amend the y-axis. Right click on y-axis and select Edit Axis. We will edit the y-axis for the following:\r\nUnder the General pane, update range. Select radio button for fixed and amend start and end to -3,000,000 and 8,500,000 respectively.\r\nUpdate Title under Axis Titles to “Singapore Dollars ($’000)”.\r\nUnder the Tick Marks pane, select radio button for fixed and amend Tick Interval to 2,000,000.\r\n\r\nFigure 33: Update range and title of y-axisFigure 34: Update tick interval of y-axisNext, we will amend the x-axis. Right click on x-axis and select Edit Axis. We will edit the x-axis for the following:\r\nUnder the General pane, update range. Select radio button for fixed and amend start and end to 1/12/2018 and 31/1/2021 respectively. This is to provide a small gap at the start and end of each trellis panel. Next, uncheck Show times.\r\nUpdate Title under Axis Titles to “Month”.\r\nUnder the Tick Marks pane, select radio button for fixed and amend Tick origin to begin at 1/1/2019, and Tick Interval to 6 months.\r\n\r\nFigure 35: Update range and title of x-axisFigure 36: Update tick interval of x-axisUpdate the Legend Title by clicking on the small drop down arrow on the legend pane and selecting Edit Title.\r\nNo\r\nOriginal Title\r\nUpdated Title\r\n1\r\nMeasure Names\r\nTrade Type\r\n2\r\nSum(Net Exports/Imports)\r\nNet Exports/Imports\r\nFigure 37: Update legend titleFigure 38: Update legend titleCreate two calculated fields [Net export position] and [Net import position], with the formulas shown in Figure 39 and Figure 40 respectively. Drag these two fields into the Sum(Net exports/imports) Marks card under Tooltip.\r\nFigure 39: Create Net export position calculated fieldFigure 40: Create Net import position calculated fieldClick on Tooltip > Insert the above calculated fields under Net exports/imports and color <AGG(Net export position)> and <AGG(Net import position)> green and red respectively (Figure 41). Edit Tooltip in the Measure Values Marks card (Figure 42).\r\nFigure 41: Edit Tooltip for Sum(Net Exports/Imports) Marks cardFigure 42: Edit Tooltip for Measure Values Marks cardAlign fonts used in graph to Tableau Light. Adjust size of labels and legends to font size 9.\r\nSort trellis by [Exports($’000)]. Under Measure Values Marks card, Select [Country] > Sort > Sort by Field > Descending order > Input Field Name as “Exports($’000)” > Select Sum under Aggregation. This sorts the trellis panel by exports across the six countries.\r\nFigure 43: Sort by exportsAdd commentary: “Exports to the six trading partners have increased 2.0%, while imports have reduced 2.8%. There does not appear to be a seasonality effect for both exports and imports.” Apply bold effect to the percentages to accentuate them.\r\nAdd reference line to the x-axis. Right click on x-axis > select scope as Per Pane > change value type to constant and choose 1 Jan 2020 > Change Label to none and Tooltip to automatic. We also update the reference line formatting by selecting a thinner, dotted line and grey color, so as to differentiate it from the other gridlines in the chart. The reference line allows users to better segregate between both years, for each panel.\r\nFigure 44: Add Reference Line5.1 Dashboard\r\nAdd sheets into dashboard- Drag the “Singapore’s Trade with 6 countries” sheet into the dashboard.\r\nAdd dashboard title- Using Objects > Text > drag to top of dashboard. Add title: “Singapore’s Merchandise Trade with Six Trading Countries, 2019-2020”. Adjust the title to be aligned in the middle. Click on title and select the Layout tab > Background > select a grey background and white font for the dashboard title so that the title stands out from the rest of the graph.\r\nAdd source- Using Objects > Text > drag to bottom of dashboard and add: Source: Department of Statistics, Singapore (DOS) (https://www.singstat.gov.sg/) The raw data: https://www.singstat.gov.sg/find-data/search-by-theme/trade-and-investment/merchandise-trade/latest-data\r\nAdd author- Using Objects > Text > drag to bottom right of dashboard and add: Dataviz Makeover 1| Stella Loh\r\n6. Observations\r\nThere does not appear to be a seasonality pattern in the exports and imports across both years (2019 and 2020), across the six countries.\r\nHong Kong and Taiwan have remained consistently in the net export and net import position respectively.\r\nSingapore’s net trade with Malaysia is becoming increasing negative (net import position) in 2020, as compared to 2019. This is mainly due to declining exports to Malaysia. Exports have reduced 18.2% Y-O-Y while imports have increased 1.2% Y-O-Y.\r\nConversely, Singapore’s net trade with United States is becoming increasing positive (net export position) in 2020, as compared to 2019. This is mainly due to increasing exports to United States. Exports have increased 19.3% Y-O-Y while imports have reduced 19.0% Y-O-Y, making Singapore a net exporter for most of 2020.\r\nImports from Hong Kong are significantly lower than the other five countries.\r\nExports and imports to/ from Japan remain relatively stable over both years. Both exports and imports with Japan are relatively close and hence the net export or import position is small.\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-05-24-dafaviz-makeover-1/Image/finalviz.JPG",
    "last_modified": "2021-05-30T18:30:39+08:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome!",
    "description": "Welcome to my blog. I will be updating this blog with Dataviz projects I have undertaken. Feel free to contact me via [email](mailto:stellaloh91@gmail.com) with any comments!",
    "author": [
      {
        "name": "Stella Loh",
        "url": "https://www.linkedin.com/in/stella-loh-308b72129/"
      }
    ],
    "date": "2021-05-23",
    "categories": [
      "welcome"
    ],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": "posts/welcome/Image/data.jpeg",
    "last_modified": "2021-05-24T23:21:50+08:00",
    "input_file": {}
  }
]
